Revit 2026 API

# MetallicpaintFinishType Enumeration

---

The enumerated type representing the permitted values for the asset property "MetallicpaintFinish" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MetallicpaintFinishType
```
```vb
Public Enumeration MetallicpaintFinishType
```
```cpp
public enum class MetallicpaintFinishType
```
```fsharp
type MetallicpaintFinishType
```

| Member name | Value | Description |
| --- | --- | --- |
| Peeling | 1 |  |
| Smooth | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace